In [1]:
import pandas as pd
print(pd.__version__)

2.0.3

In [3]:
data = {'nama': ['verstappen', 'leclerc', 'hamilton', 'vettel'],
        'jenis_kelamin': ['L', 'L', 'L', 'L'], 
        'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

         nama jenis_kelamin  usia
0  verstappen             L    23
1     leclerc             L    21
2    hamilton             L    22
3      vettel             L    25

In [4]:
df['nama'].str.cat(df['jenis_kelamin'], sep=', ').to_frame()

            nama
0  verstappen, L
1     leclerc, L
2    hamilton, L
3      vettel, L

In [5]:
df['nama'].str.cat(df['usia'].astype('str'), sep=' - ').to_frame()

              nama
0  verstappen - 23
1     leclerc - 21
2    hamilton - 22
3      vettel - 25

In [6]:
df['nama_usia'] = df['nama'].str.cat(df['usia'].astype('str'), sep=' - ')
df

         nama jenis_kelamin  usia        nama_usia
0  verstappen             L    23  verstappen - 23
1     leclerc             L    21     leclerc - 21
2    hamilton             L    22    hamilton - 22
3      vettel             L    25      vettel - 25